// Задача №1: В введенной строке найти подстроку. В результате работе вывести позицию 1 вхождения подстроки.
// Задача №2: Изменить значение текста на подтекст. В результате изменяется тексты
// Задача №3: В введенном тексте удалить элементы из подстроки. В результате работы функции изменяется текст
#include <stdio.h> //Подключение библиотек
#include <stdbool.h>

// Пример 1
int FindSubString(char *someText, char *someStr)
{                                             // Функция FindSubString, принимающая в качестве аргументов адрес на сам текст и подстроку.
    if(someText && someStr && someText[0] !='\n' && someStr[0] !='\n'){
        char * tx = NULL;                              // Указатель для навигации по тексту
        char * sx = NULL;                              // Указатель для навигации по подстроке
        bool isHere = false; // Флаг для проверки наличия подстроки в тексте
        int i = 0;           // Переменная-индекс для прохода по тексту и сохранения позиции в тексте

        for (; someText[i] != '\0' && (!isHere); i++) // Цикл для прохода по тексту
        {
            tx = someStr;                     // Адрес 1 элемента подстроки
            sx = &someText[i];                // Адрес i элемента текста
            while (*tx != '\0' && *sx == *tx) // Цикл, пока не конец подстроки и элементы подстроки и текста равны
            {
                sx++; // Переход к следующим элементам
                tx++;
            }
            if (*tx == '\0' || *tx == '\n'){ //Если прошли до конца подстроки, значит, нашли в тексту данную подстроку. Поднимаем флаг
                isHere = true;
            }
        }

        if (isHere){ //Если есть подстрока, выводим  позицию
            return i-1;
        }
        else{ //Инчае выводим флаг -1 для обозначения отсутствия подстроки
            return -1;
        }
    }
    else
        return -2;

}


// Пример 2
void ChangeText(char *someText, char *someStr)
{
    if (someText && someStr){
        char *strA = someText; // Указатель на 1 элемыент текста
        char *strB = someStr;  // Указатель на 1 элемент подстроки

        *strA++ = *strB++;                    //Замена текста на подстроку
    }
}

// Пример 3
void DeleteStr(char *someText, char *someStr) // Функция DeleteStr, принимающая в качестве аргументов адрес на текст и подстроки
{   
    if (someText && someStr){                                          // Функция удаляет элементы подстроки из текста
        char *ptrSymbols = someStr;
        bool Tab[256] = {0}; // Массив для хранения элементов, которые содержатся в подстроке

        while (*ptrSymbols) // Цикл для считывания элементов с подстроки для отметки в массив Tab
        {
            Tab[*ptrSymbols++] = true;
        }

        int i = 0; // Переменная для хранения индекса последнего изменения в тексте
        int j = 0; // Переменная для прохода по тексту

        while (someText[i]) //Пока есть буквы в тексте
        {
            if (!Tab[someText[i]]) //Если символа текста в подстроке, то удаляем
            {
                someText[j] = someText[i]; //Заменяем символы
                j++;
            }
            i++;
        }
        someText[j] = '\0'; //Ставим конец строки под конец
    }
}



// Основной блок
int main()
{
    char someText[100];          // Массив для текста
    char someStr[100];           // Массив для подстроки

    fgets(someText, 100, stdin); // Ввод текста
    fgets(someStr, 100, stdin);  // Ввод подстроки

    int position = FindSubString(someText, someStr);// Нахождение позиции подстроки

    if (position >= 0){ //Если позиция существует, то выводим
        printf("Fragments position is = %d.\n",position);
    }
    else if (position == -1){ //Если значение -1, то позиции нет. Выводим об отсутствии
        printf("Fragment is absent.\n");
    }
    else{// Иначе, не было введено теста/подстроки
        printf("The text/sub string was not entered.\n");
    }
    return 0;
}