#include <stdio.h>    // Подключение стандартной библиотеки ввода-вывода
#include <stdlib.h>   // Подключение стандартной библиотеки для работы с памятью, числами и другими функциями
#include <limits.h>   // Подключение стандартной библиотеки для работы с предельными значениями целочисленных типов

int main() {
    long int inputNumber;     // Переменная для хранения исходного числа
    int scanResult = scanf("%ld", &inputNumber);    // Переменная для проверки ввода

    // Проверка корректности ввода
    if (scanResult == 0) {
        printf("Wrong data\n");    // Сообщение об ошибке в случае некорректного ввода
        return 1;    // Возвращаем код ошибки
    }

    // Проверка, превышает ли число допустимые пределы для типа int
    if (inputNumber > INT_MAX || inputNumber < INT_MIN) {
        printf("The number is too big!\n");
        return 1;    // Возвращаем код ошибки
    }

    int number = inputNumber;
    int reversedNumber = 0;    // Переменная для перевернутого числа
    int remainder = 0;         // Временная переменная для хранения остатка

    int isNegative = 0;        // Флаг для определения знака исходного числа
    if (number < 0) {          // Если число отрицательное
        isNegative = 1;        // Устанавливаем флаг
    }

    number = abs(number);      // Берем модуль числа для удобства обработки

    int overflowCheck = 0;     // Флаг для проверки переполнения
    // Проход по всем цифрам числа
    while (number != 0) {
        remainder = number % 10;    // Определение последней цифры числа
        reversedNumber = reversedNumber * 10 + remainder;    // Формирование перевернутого числа
        // Если произошло переполнение
        if (reversedNumber < 0) {
            number = 0;    // Прерываем цикл
            overflowCheck = 1;    // Устанавливаем флаг переполнения
            break;    // Прерываем цикл
        }
        number = number / 10;    // Убираем последнюю цифру числа
    }

    // Если произошло переполнение
    if (overflowCheck) {
        printf("The number is too big!\n");    // Выводим сообщение о переполнении
        return 1;    // Возвращаем код ошибки
    } else {    // Если переполнения не произошло
        if (isNegative) {    // Если исходное число было отрицательным
            reversedNumber *= -1;    // Меняем знак у перевернутого числа
        }
        printf("Result: %d\n", reversedNumber);    // Выводим результат
    }

    return 0;    // Возвращаем 0, чтобы показать успешное завершение программы
}
