#include <stdio.h> // Подключение стандартной библиотеки ввода-вывода
#include <stdlib.h> // Подключение стандартной библиотеки для работы с памятью, числами и другими функциями

int main() {
    long int Value = 0;
    int rez = scanf_s("%ld", &Value);
    int longValue = Value;
    printf("%d %ld", longValue, Value);
    if (Value < longValue) {
        printf("intValue < longValue\n");
    }
    else if (Value > longValue) {
        printf("intValue > longValue\n");
    }
    else {
        printf("intValue = longValue\n");
    }

    int N = Value;

    int V = 0; // Переменная для перевернутого числа
    int OST = 0; // Временная переменная для хранения остатка

    if (rez == 0) // Проверка корректности ввода
    {
        printf("Wrong data"); // Сообщение об ошибке в случае некорректного ввода
    }

    int flag = 0; // Флаг для определения знака исходного числа
    if (N < 0) // Если число отрицательное
        flag = 1; // Устанавливаем флаг

    N = abs(N); // Берем модуль числа для удобства обработки

    int check = 0; // Флаг для проверки переполнения
    while (N != 0) // Проход по всем цифрам числа
    {
        OST = N % 10; // Определение последней цифры числа
        V = V * 10 + OST; // Формирование перевернутого числа
        if (V < 0) // Если произошло переполнение
        {
            N = 0; // Прерываем цикл
            check = 1; // Устанавливаем флаг переполнения
            break; // Прерываем цикл
        }
        N = N / 10; // Убираем последнюю цифру числа
    }

    if (check) // Если произошло переполнение
    {
        printf("The number is too big!\n"); // Выводим сообщение о переполнении
    }
    else // Если переполнения не произошло
    {
        if (flag) // Если исходное число было отрицательным
            V *= -1; // Меняем знак у перевернутого числа
        printf("Result: %d", V); // Выводим результат
    }

    return 0; // Возвращаем 0, чтобы показать успешное завершение программы
}
